app/views/restaurants/index.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 2]]
---
    <ul>
      <% restaurant.reviews.each do |review| %>