app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-13 10:15:36.619213"], ["name", "KFC"], ["updated_at", "2014-08-13 10:15:36.619213"]]
---
	def create
		Restaurant.create(params[:restaurant].permit(:name))

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
---
	def update
		@restaurant = Restaurant.find(params[:id])