app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "reviews" ("created_at", "rating", "restaurant_id", "thoughts", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-08-14 12:47:48.776265"], ["rating", 5], ["restaurant_id", 2], ["thoughts", "Great food!"], ["updated_at", "2014-08-14 12:47:48.776265"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @restaurant.reviews.create(params[:review].permit(:rating, :thoughts))